Documents/ПланРуководителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ПланРуководителя</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокСтатей</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статья</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПланРуководителя/Ext/ManagerModule.bsl
Процедура ПечатьПлан(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьПлан)
	Макет = Документы.ПланРуководителя.ПолучитьМакет("ПечатьПлан");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПланРуководителяСписокСтатей.Родитель КАК Родитель,
	|	ПланРуководителяСписокСтатей.Статья,
	|	ПланРуководителяСписокСтатей.Сумма КАК Сумма,
	|	ПланРуководителяСписокСтатей.Дата,
	|	ПланРуководителяСписокСтатей.Родитель.Код КАК Код,
	|	ПланРуководителяСписокСтатей.Статья.Код,
	|	ПланРуководителяСписокСтатей.Комментарий,
	|	ПланРуководителяСписокСтатей.Ссылка.Подразделение КАК Подразделение,
	|	ПланРуководителяСписокСтатей.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ПланРуководителя.СписокСтатей КАК ПланРуководителяСписокСтатей
	|ГДЕ
	|	ПланРуководителяСписокСтатей.Ссылка В(&Ссылка)
	|ИТОГИ
	|	СУММА(Сумма),
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(Подразделение)
	|ПО
	|	Ссылка,
	|	Родитель";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСписокСтатейШапка = Макет.ПолучитьОбласть("СписокСтатейШапка");
	ОбластьСписокСтатей = Макет.ПолучитьОбласть("СписокСтатей");
	ОбластьСтатьи = Макет.ПолучитьОбласть("Статьи");
	ОбластьИтого = Макет.ПолучитьОбласть("Итоги");
	ТабДок.Очистить();
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ТабДок.Вывести(ОбластьЗаголовок);
		ОбластьШапка.Параметры.Подразделение = Выборка.Подразделение;
		ТабДок.Вывести(ОбластьШапка);
		ТабДок.Вывести(ОбластьСписокСтатейШапка);
		ВыборкаРодитель = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаРодитель.Следующий() Цикл
			ОбластьСписокСтатей.Параметры.Заполнить(ВыборкаРодитель);
			ТабДок.Вывести(ОбластьСписокСтатей);
			ТабДок.НачатьГруппуСтрок();
			ВыборкаСписокСтатей = ВыборкаРодитель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаСписокСтатей.Следующий() Цикл
				ОбластьСтатьи.Параметры.Заполнить(ВыборкаСписокСтатей);
				ТабДок.Вывести(ОбластьСтатьи);
			КонецЦикла;
			ТабДок.ЗакончитьГруппуСтрок();
		КонецЦикла;
		ОбластьИтого.Параметры.Итого = Выборка.Сумма;
		ТабДок.Вывести(ОбластьИтого);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
